[
  {
    "id": 1,
    "image": "https://i.ibb.co.com/yBVspn20/spotify.png",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "description": "Spotify is the world’s most popular music streaming service, offering instant access to an unparalleled library of over 80 million songs, albums, and playlists from every corner of the globe. Whether you’re a casual listener or a dedicated audiophile, Spotify’s powerful algorithms analyze your listening habits to deliver personalized recommendations, ensuring you always discover music that resonates with your mood and taste. Dive into expertly curated playlists, exclusive artist releases, and deep cuts from emerging talents across genres like pop, jazz, hip-hop, electronic, and classical.\n\nBeyond music, Spotify is a hub for podcasts, audiobooks, and original content, making it a one-stop destination for all your audio needs. Enjoy seamless offline listening, so your favorite tracks are always with you, even without an internet connection. Create and share playlists with friends, collaborate on group playlists, and explore what’s trending in real-time. With high-quality audio streaming, an intuitive user interface, and innovative features like Spotify Wrapped—your annual personalized music recap—Spotify transforms every listening session into a unique and immersive experience. Whether you’re working out, relaxing, or on the go, Spotify is designed to be your ultimate soundtrack for life.",
    "size": 38,
    "reviews": 18000000,
    "ratingAvg": 4.6,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 3500000 },
      { "name": "5 star", "count": 12800000 }
    ]
  },
  {
    "id": 2,
    "image": "https://i.ibb.co.com/hJsKts3R/tiktok.png",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "description": "TikTok is the global phenomenon redefining short-form video content, where creativity knows no bounds and entertainment is just a tap away. With a feed powered by cutting-edge AI, TikTok delivers an endless stream of videos tailored to your interests—whether you’re into comedy, dance, cooking, fashion, or DIY projects. The platform’s intuitive editing tools, augmented reality effects, and vast music library empower users to create professional-quality videos in seconds, fostering a community where anyone can go viral and trends are born overnight.\n\nBeyond entertainment, TikTok is a cultural hub where users connect, collaborate, and inspire each other. The app’s ‘For You’ page is a gateway to discovering new creators, challenges, and ideas from around the world, making every scroll a unique adventure. Live streaming, duets, and stitch features encourage interaction and creativity, while robust privacy controls ensure a safe and positive experience. Whether you’re looking to laugh, learn, or showcase your talent, TikTok’s vibrant ecosystem makes it the ultimate platform for self-expression and global connection.",
    "size": 52,
    "reviews": 24000000,
    "ratingAvg": 4.4,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 800000 },
      { "name": "2 star", "count": 900000 },
      { "name": "3 star", "count": 2200000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 15100000 }
    ]
  },
  {
    "id": 3,
    "image": "https://i.ibb.co.com/8nYhF3m3/snapChat.png",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "description": "Snapchat revolutionizes the way we communicate by blending spontaneity, creativity, and privacy into a single, dynamic platform. At its core, Snapchat allows users to send photos and short videos—known as ‘Snaps’—that disappear after being viewed, encouraging authentic and in-the-moment sharing. The app’s innovative features, such as augmented reality lenses, face filters, and Bitmoji avatars, transform everyday moments into playful, shareable content that reflects your personality and mood.\n\nBeyond one-on-one messaging, Snapchat’s ‘Stories’ feature lets you share daily highlights with all your friends, while ‘Discover’ connects you to content from publishers, creators, and brands. The platform’s emphasis on privacy and security, including end-to-end encryption and customizable sharing settings, ensures your conversations and memories stay protected. With real-time chat, voice and video calls, and a constantly evolving suite of creative tools, Snapchat is more than just a messaging app—it’s a vibrant community where every interaction feels fresh, fun, and uniquely you.",
    "size": 34,
    "reviews": 13000000,
    "ratingAvg": 4.3,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1100000 },
      { "name": "4 star", "count": 2700000 },
      { "name": "5 star", "count": 7900000 }
    ]
  },
  {
    "id": 4,
    "image": "https://i.ibb.co.com/0Rv7bW1Y/youtube.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "description": "YouTube stands as the undisputed leader in online video, offering an unparalleled platform where creativity, education, and entertainment converge. With over 2 billion logged-in monthly users, YouTube hosts an astonishing diversity of content—from blockbuster movie trailers and chart-topping music videos to in-depth tutorials, live streams, and thought-provoking documentaries. The platform’s advanced recommendation system learns your preferences over time, ensuring your homepage is always filled with videos that match your interests, whether you’re exploring new hobbies, catching up on news, or diving into niche communities.\n\nCreators on YouTube have access to powerful tools for editing, analytics, and monetization, allowing them to turn their passions into professions and build loyal audiences. Features like Super Chat, Memberships, and the YouTube Partner Program enable fans to support their favorite creators directly. For viewers, the experience is equally rich: create playlists, download videos for offline viewing, and engage with content through likes, comments, and shares. YouTube’s global reach and commitment to innovation make it not just a video-sharing platform, but a cultural force that shapes trends, sparks conversations, and connects people across the world.",
    "size": 45,
    "reviews": 52000000,
    "ratingAvg": 4.7,
    "downloads": 10000000000,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 1200000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 9000000 },
      { "name": "5 star", "count": 38800000 }
    ]
  },
  {
    "id": 5,
    "image": "https://i.ibb.co.com/bRQ00X7r/whatsApp.png",
    "title": "WhatsApp",
    "companyName": "Meta Platforms Inc.",
    "description": "WhatsApp is the world’s most trusted messaging app, enabling over 2 billion users to communicate instantly, securely, and reliably across the globe. With its intuitive interface and robust feature set, WhatsApp allows you to send text messages, make crystal-clear voice and video calls, and share photos, videos, documents, and locations—all protected by state-of-the-art end-to-end encryption. This ensures that your conversations, calls, and shared media remain private and accessible only to you and your intended recipients.\n\nBeyond individual chats, WhatsApp’s group features make it easy to connect with family, friends, or colleagues, supporting up to 256 participants in a single group. Share status updates that vanish after 24 hours, use voice messages for quick communication, and enjoy seamless media sharing without worrying about file size limits. WhatsApp Business further extends the platform’s utility, allowing small businesses to create catalogs, automate responses, and engage with customers directly. Available on both mobile and desktop, WhatsApp works across platforms and networks, ensuring you stay connected no matter where you are. Whether for personal use or professional collaboration, WhatsApp’s simplicity, security, and reliability make it the go-to app for meaningful communication.",
    "size": 38,
    "reviews": 32000000,
    "ratingAvg": 4.5,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 1400000 },
      { "name": "3 star", "count": 2100000 },
      { "name": "4 star", "count": 4800000 },
      { "name": "5 star", "count": 22700000 }
    ]
  },
  {
    "id": 6,
    "image": "https://i.ibb.co.com/Z4NDhtx/instagram-2.png",
    "title": "Instagram",
    "companyName": "Meta Platforms Inc.",
    "description": "Instagram is the world’s premier visual storytelling platform, where creativity meets community in a vibrant, ever-evolving space. More than just a photo-sharing app, Instagram empowers users to express themselves through stunning images, short-form Reels, and immersive Stories that disappear after 24 hours. Its powerful editing tools—including advanced filters, effects, and augmented reality features—allow anyone to transform ordinary moments into captivating visual narratives. The app’s intelligent algorithm curates a personalized feed, ensuring you discover content that aligns with your passions, whether it’s fashion, travel, food, or art.\n\nBeyond personal expression, Instagram fosters connections through likes, comments, and direct messages, making it a hub for influencers, brands, and everyday users alike. Live streaming and IGTV offer deeper engagement, while shopping tags and business profiles turn inspiration into action. With a focus on authenticity and innovation, Instagram is not just a social network; it’s a global stage where every post has the potential to inspire, entertain, and connect millions.",
    "size": 58,
    "reviews": 46000000,
    "ratingAvg": 4.4,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 1500000 },
      { "name": "2 star", "count": 1800000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 7200000 },
      { "name": "5 star", "count": 31500000 }
    ]
  },
  {
    "id": 7,
    "image": "https://i.ibb.co.com/dwK1BGD2/gps.png",
    "title": "GPS Navigation",
    "companyName": "SmartMap Technologies",
    "description": "GPS Navigation redefines the way you travel by combining cutting-edge technology with user-friendly design. This app provides real-time, turn-by-turn voice guidance, live traffic updates, and alternative route suggestions to help you navigate with confidence. Whether you’re commuting to work, embarking on a road trip, or exploring a new city, its offline maps ensure you never lose your way, even without an internet connection. The interface is intuitive, displaying speed limits, points of interest, and road hazards to keep your journey smooth and safe.\n\nCustomizable features allow you to save favorite locations, avoid tolls, and receive alerts for speed cameras. With regular map updates and adaptive routing, GPS Navigation is more than just a directions app—it’s your trusted co-pilot, making every trip efficient, stress-free, and enjoyable. Perfect for drivers, cyclists, and pedestrians, it turns navigation into a seamless experience, so you can focus on the road ahead.",
    "size": 62,
    "reviews": 420000,
    "ratingAvg": 4.2,
    "downloads": 50000000,
    "ratings": [
      { "name": "1 star", "count": 15000 },
      { "name": "2 star", "count": 25000 },
      { "name": "3 star", "count": 60000 },
      { "name": "4 star", "count": 120000 },
      { "name": "5 star", "count": 200000 }
    ]
  },
  {
    "id": 8,
    "image": "https://i.ibb.co.com/JRxLkNY6/tv-app.png",
    "title": "Smart TV Hub",
    "companyName": "VisionSoft Ltd.",
    "description": "Smart TV Hub transforms your television into a powerhouse of entertainment, bringing all your favorite streaming services, live TV channels, and on-demand content into one sleek, easy-to-navigate interface. Whether you’re in the mood for blockbuster movies, binge-worthy series, or live sports, this app curates recommendations based on your viewing habits, ensuring you always find something worth watching. Its voice control feature lets you search for shows, adjust settings, and even control smart home devices—all without lifting a finger.\n\nWith support for multiple user profiles, parental controls, and 4K HDR streaming, Smart TV Hub caters to every member of the family. You can cast content from your phone, create watchlists, and enjoy a cinematic experience with optimized picture and sound quality. By integrating popular platforms like Netflix, Disney+, and YouTube, it eliminates the hassle of switching between apps, making your TV smarter and your leisure time more enjoyable.",
    "size": 70,
    "reviews": 280000,
    "ratingAvg": 4.1,
    "downloads": 20000000,
    "ratings": [
      { "name": "1 star", "count": 9000 },
      { "name": "2 star", "count": 14000 },
      { "name": "3 star", "count": 40000 },
      { "name": "4 star", "count": 70000 },
      { "name": "5 star", "count": 147000 }
    ]
  },
  {
    "id": 9,
    "image": "https://i.ibb.co.com/TBfJmwnP/keep.png",
    "title": "Google Keep",
    "companyName": "Google LLC",
    "description": "Google Keep is the ultimate digital notebook for capturing ideas, organizing tasks, and staying productive on the go. Its minimalist design and intuitive features make it effortless to jot down notes, create to-do lists, and set reminders—all synced across your devices in real time. You can enhance your notes with color coding, labels, and images, while voice memos allow for hands-free convenience. Collaboration is a breeze, as you can share notes with friends, family, or colleagues and work together in real time.\n\nIntegrated with Google’s ecosystem, Keep seamlessly connects with Docs, Calendar, and Gmail, turning your thoughts into actionable tasks. Whether you’re planning a project, brainstorming ideas, or simply keeping track of daily errands, Google Keep’s simplicity and power make it an indispensable tool for anyone looking to stay organized and focused. With offline access and smart search, your notes are always within reach, exactly when you need them.",
    "size": 18,
    "reviews": 5000000,
    "ratingAvg": 4.7,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 190000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1000000 },
      { "name": "5 star", "count": 3260000 }
    ]
  },
  {
    "id": 10,
    "image": "https://i.ibb.co.com/jPnmFFMm/mail-inbox-app.png",
    "title": "Mail Inbox",
    "companyName": "NextWave Labs",
    "description": "Mail Inbox revolutionizes email management by consolidating all your accounts into a single, streamlined platform. Its intelligent inbox automatically sorts messages into categories—prioritizing important emails, filtering out spam, and organizing newsletters—so you can focus on what matters most. With features like scheduled sending, read receipts, and customizable swipe actions, it puts you in control of your communication.\n\nThe app’s clean, ad-free interface ensures a distraction-free experience, while robust encryption keeps your data secure. Whether you’re managing personal correspondence or professional emails, Mail Inbox’s fast syncing and offline access make it a reliable companion. Designed for efficiency, it helps you achieve inbox zero with ease, turning email from a chore into a seamless part of your daily routine.",
    "size": 22,
    "reviews": 850000,
    "ratingAvg": 4.3,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 30000 },
      { "name": "3 star", "count": 90000 },
      { "name": "4 star", "count": 180000 },
      { "name": "5 star", "count": 530000 }
    ]
  },
  {
    "id": 11,
    "image": "https://i.ibb.co.com/h1R6BPn8/viber.png",
    "title": "Viber",
    "companyName": "Rakuten Inc.",
    "description": "Viber connects you to the people who matter most with high-quality messaging, voice, and video calls—all protected by end-to-end encryption for ultimate privacy. Its vibrant, user-friendly interface makes communication fun and expressive, with a vast library of stickers, GIFs, and emojis to bring your conversations to life. Group chats support up to 250 participants, making it perfect for family gatherings, team collaborations, or community discussions.\n\nBeyond personal messaging, Viber offers public chats and channels where you can follow brands, celebrities, and news outlets. The app syncs seamlessly across devices, ensuring you never miss a message, and its low-data mode makes it ideal for users in areas with limited connectivity. With Viber Out, you can even make international calls to non-Viber users at affordable rates. Whether for casual chats or professional discussions, Viber combines security, simplicity, and creativity in one powerful app.",
    "size": 40,
    "reviews": 7500000,
    "ratingAvg": 4.5,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 350000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 1300000 },
      { "name": "5 star", "count": 5050000 }
    ]
  },
  {
    "id": 12,
    "image": "https://i.ibb.co.com/ycV6JKZR/github.png",
    "title": "GitHub",
    "companyName": "GitHub Inc.",
    "description": "GitHub is the world’s leading platform for software development and collaboration, where millions of developers and organizations build, ship, and maintain their projects. Its robust version control system, powered by Git, allows teams to work together seamlessly, tracking changes, reviewing code, and managing issues in real time. With features like pull requests, branching, and merges, GitHub streamlines the development workflow, making it easier to contribute to open-source projects or private repositories.\n\nThe mobile app keeps you connected to your work, allowing you to review code, respond to comments, and merge pull requests from anywhere. GitHub’s community-driven approach fosters innovation, with tools like GitHub Actions for automation and GitHub Pages for hosting websites. Whether you’re a solo developer or part of a large team, GitHub provides the infrastructure and community support to turn ideas into reality, making it the backbone of modern software development.",
    "size": 28,
    "reviews": 2200000,
    "ratingAvg": 4.8,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 80000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 450000 },
      { "name": "5 star", "count": 1475000 }
    ]
  },
  {
    "id": 13,
    "image": "https://i.ibb.co.com/QgxfMWy/stock-exchange-app.png",
    "title": "Stock Exchange",
    "companyName": "TradePro Global",
    "description": "Stock Exchange puts the power of the financial markets in your hands, offering real-time stock quotes, interactive charts, and personalized watchlists to track your investments. Its intuitive interface provides detailed analytics, including technical indicators, historical data, and market news, helping you make informed trading decisions. Customizable alerts notify you of price movements, earnings reports, and breaking news, so you never miss an opportunity.\n\nWhether you’re a seasoned investor or just starting out, the app’s educational resources and simulated trading features make it easy to learn and grow your portfolio. With secure, fast execution and support for multiple asset classes, Stock Exchange is your ultimate tool for navigating the complexities of the stock market with confidence and precision.",
    "size": 37,
    "reviews": 1800000,
    "ratingAvg": 4.6,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 50000 },
      { "name": "3 star", "count": 100000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 1320000 }
    ]
  },
  {
    "id": 14,
    "image": "https://i.ibb.co.com/5gxRQh6M/video-editing-app.png",
    "title": "Video Editor Pro",
    "companyName": "VisionWorks",
    "description": "Video Editor Pro is a comprehensive editing suite that transforms your raw footage into polished, professional-quality videos. Its timeline-based editor supports multiple layers of video, audio, and effects, giving you complete creative control. Advanced features like keyframe animation, color grading, and green screen effects allow for precision editing, while a library of templates, transitions, and royalty-free music speeds up the creative process.\n\nDesigned for both beginners and professionals, the app offers tutorials and AI-powered tools to enhance your edits automatically. Export your projects in up to 4K resolution and share them directly to social media platforms. Whether you’re creating content for YouTube, TikTok, or professional presentations, Video Editor Pro combines power and simplicity, making video editing accessible and enjoyable for everyone.",
    "size": 85,
    "reviews": 950000,
    "ratingAvg": 4.4,
    "downloads": 20000000,
    "ratings": [
      { "name": "1 star", "count": 25000 },
      { "name": "2 star", "count": 40000 },
      { "name": "3 star", "count": 120000 },
      { "name": "4 star", "count": 250000 },
      { "name": "5 star", "count": 515000 }
    ]
  },
  {
    "id": 15,
    "image": "https://i.ibb.co.com/bj0vfrG4/facebook-messenger-logo.png",
    "title": "Facebook Messenger",
    "companyName": "Meta Platforms Inc.",
    "description": "Facebook Messenger is a versatile and user-friendly messaging app that connects you with friends, family, and colleagues across the globe. With instant text messaging, high-quality voice and video calls, and a wide range of expressive stickers and GIFs, Messenger makes communication fun and engaging. The app also supports group chats, allowing you to connect with multiple people at once, and offers end-to-end encryption for secure conversations.\n\nBeyond messaging, Messenger integrates with Facebook’s ecosystem, enabling you to share photos, videos, and links seamlessly. Features like message reactions, chat themes, and games add a playful touch to your conversations. Whether you’re planning an event, collaborating on a project, or simply catching up with loved ones, Facebook Messenger provides a reliable and dynamic platform for staying connected.",
    "size": 40,
    "reviews": 30000000,
    "ratingAvg": 4.3,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 6000000 },
      { "name": "5 star", "count": 18500000 }
    ]
  },
  {
    "id": 16,
    "image": "https://i.ibb.co.com/0yBq3BL5/weather-app.png",
    "title": "Weather Forecast",
    "companyName": "MeteorTech",
    "description": "Weather Forecast is your go-to app for accurate, real-time weather updates and detailed forecasts. With a sleek and intuitive interface, it provides hourly, daily, and weekly weather predictions, including temperature, precipitation, wind speed, and humidity. The app also features interactive radar maps, severe weather alerts, and air quality indexes to help you plan your day with confidence.\n\nCustomizable widgets and notifications ensure you stay informed about changing weather conditions, while the app’s global coverage makes it ideal for travelers and locals alike. Whether you’re planning a weekend getaway, preparing for a storm, or just deciding what to wear, Weather Forecast delivers the information you need in a clear, user-friendly format. Stay ahead of the weather with this reliable and comprehensive app.",
    "size": 25,
    "reviews": 1200000,
    "ratingAvg": 4.5,
    "downloads": 50000000,
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 80000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 620000 }
    ]
  },
  {
    "id": 17,
    "image": "https://i.ibb.co.com/tpRg3Hpr/linkedin.png",
    "title": "LinkedIn",
    "companyName": "Microsoft Corporation",
    "description": "LinkedIn is the world’s largest professional networking platform, designed to help you build meaningful connections, advance your career, and grow your business. With a user base of over 700 million professionals, LinkedIn allows you to create a detailed profile showcasing your skills, experience, and accomplishments. The platform’s powerful search tools make it easy to find and connect with colleagues, industry leaders, and potential employers.\n\nBeyond networking, LinkedIn offers a wealth of resources, including job listings, industry news, and professional development courses. You can join groups to engage in discussions, publish articles to share your expertise, and receive endorsements to highlight your skills. Whether you’re job hunting, recruiting talent, or expanding your professional network, LinkedIn provides the tools and opportunities you need to succeed in today’s competitive marketplace.",
    "size": 50,
    "reviews": 15000000,
    "ratingAvg": 4.4,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 9300000 }
    ]
  },
  {
    "id": 18,
    "image": "https://i.ibb.co.com/9k7X9C5Q/daily-health-app.png",
    "title": "Daily Health Tracker",
    "companyName": "WellnessTech",
    "description": "Daily Health Tracker is your personal wellness companion, designed to help you monitor and improve your health and fitness. The app allows you to log daily activities, track your diet, and record vital signs like heart rate, blood pressure, and sleep patterns. With customizable goals and progress reports, it motivates you to stay on track and make healthier choices.\n\nThe app also integrates with wearable devices, syncing data seamlessly to provide a comprehensive overview of your health. Features like water intake reminders, medication trackers, and mental health journals make it a holistic tool for managing your well-being. Whether you’re aiming to lose weight, build muscle, or simply maintain a healthy lifestyle, Daily Health Tracker empowers you with the insights and tools you need to achieve your goals.",
    "size": 30,
    "reviews": 800000,
    "ratingAvg": 4.6,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 30000 },
      { "name": "3 star", "count": 80000 },
      { "name": "4 star", "count": 180000 },
      { "name": "5 star", "count": 490000 }
    ]
  },
  {
    "id": 19,
    "image": "https://i.ibb.co.com/bjKgBfmg/twitter-X.png",
    "title": "Twitter (X)",
    "companyName": "X Corp",
    "description": "Twitter, now rebranded as X, is the go-to platform for real-time updates, public conversations, and breaking news. With its fast-paced and dynamic interface, X allows users to share thoughts, links, images, and videos in short, engaging posts known as tweets. The platform’s unique features, such as retweets, likes, and replies, foster interactive discussions and help information spread quickly across the globe.\n\nX is not just a social network; it’s a powerful tool for networking, brand promotion, and staying informed about the latest trends and events. Whether you’re a casual user, a content creator, or a business looking to engage with your audience, X provides a space for open dialogue and connection. Its algorithm ensures that you see content tailored to your interests, making every visit to the platform both informative and engaging.",
    "size": 35,
    "reviews": 25000000,
    "ratingAvg": 4.2,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 6000000 },
      { "name": "5 star", "count": 13500000 }
    ]
  },
  {
    "id": 20,
    "image": "https://i.ibb.co.com/DDQVf9xK/google-drive.png",
    "title": "Google Drive",
    "companyName": "Google LLC",
    "description": "Google Drive is your secure, cloud-based hub for storing, sharing, and collaborating on files from anywhere. With 15GB of free storage and seamless integration with Google’s suite of productivity tools—Docs, Sheets, and Slides—it makes teamwork effortless. Real-time collaboration allows multiple users to edit documents simultaneously, while version history ensures you never lose important changes.\n\nThe app’s powerful search functionality, powered by Google AI, helps you find files instantly, even within images and PDFs. Advanced security features, including encryption and two-factor authentication, keep your data safe. Whether you’re backing up personal memories, managing work projects, or sharing files with clients, Google Drive offers the reliability, speed, and simplicity you need to stay productive and organized in today’s fast-paced world.",
    "size": 31,
    "reviews": 42000000,
    "ratingAvg": 4.6,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 1200000 },
      { "name": "2 star", "count": 1600000 },
      { "name": "3 star", "count": 3200000 },
      { "name": "4 star", "count": 7400000 },
      { "name": "5 star", "count": 29600000 }
    ]
  }
]
